Revit 2027 API
TabbedDialogExtension.OnCancelAction Property
The cancel handler.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public TabbedDialogAction OnCancelAction { get; set; }
Public Property OnCancelAction As TabbedDialogAction
	Get
	Set
public:
property TabbedDialogAction^ OnCancelAction {
	TabbedDialogAction^ get ();
	void set (TabbedDialogAction^ value);
}
member OnCancelAction : TabbedDialogAction with get, set
Property Value
TabbedDialogAction
Remarks
This handler will be invoked when the "Cancel" button in Revit options dialog is clicked. The Revit options dialog will be closed directly if this property was set to null.
See Also
Reference
TabbedDialogExtension Class
Autodesk.Revit.UI Namespace